app/Controllers/Admin/AdminController.php

SELECT COUNT(*) AS `numrows`
FROM `tickets`
---
    public function perfil() {
        $tickets = model('Ticket');

        $totalTickets = $tickets->countAllResults();