app/Controllers/Admin/TicketController.php

    public function index()
    {
        $db = \Config\Database::connect();
        $total = $db->table('tickets')->countAll();
        $tickets = model('Ticket');

        $builder = $db->table('status');
        $builder->join('tickets', 'tickets.status=status.id');
        $status = $builder->get();
        // $status = $builder->where('status.id', 'ASC')->get();

        $builder2 = $db->table('areas')->select('areas.name');
        $builder2->join('users', 'users.area = areas.id');
        $builder2->join('tickets', 'users.id = tickets.usuario');
        $usuario = $builder2->get();

        $data = [
            'title'     => 'Tickets de soporte',
            'total'     => $total,
            'status'    => $status,
            // // 'tickets'   => $tickets->findAll(),
            // 'tickets'   => $tickets->orderBy('status', 'ASC')->findAll()
            'tickets'   => $tickets->orderBy('id', 'desc')->findAll(),
---
SELECT COUNT(*) AS `numrows` FROM `tickets`
SELECT *
FROM `status`
JOIN `tickets` ON `tickets`.`status`=`status`.`id`
SELECT `areas`.`name`
FROM `areas`
JOIN `users` ON `users`.`area` = `areas`.`id`
JOIN `tickets` ON `users`.`id` = `tickets`.`usuario`
SELECT *
FROM `tickets`
ORDER BY `id` DESC