app/Controllers/Admin/UsuariosController.php

SELECT *
FROM `users`
---
    public function index()
    {
        $users = model(UserModel::class);


        $db = \Config\Database::connect();

        // $query = mysql_query("SELECT * FROM areas join users on areas.id = users.area");

        $data = [
            'title' => 'Usuarios',
            'usuarios'  => $users->findAll(),
            // 'area'  => $query
        ];

SELECT *
FROM `areas`
---
    public function new()
    {
        $areas = model('Area');

        $data = [
            'title' => 'Nuevo registro de usuario',
            'areas' => $areas->findAll()
        ];

INSERT INTO `users` (`name`, `apaterno`, `amaterno`, `email`, `phone_no`, `password`, `role`, `area`, `created_at`, `updated_at`) VALUES ('Carmen', 'Dompinguez', 'Fern', 'carmen@mail.com', '2311245678', '$2y$10$C2XW4YW7gO4A3hVMTbkw6.mILbPpiLjNtxT7CPVsg9bDfO1j3d636', 'usuario', '2', '2022-11-20 13:36:19', '2022-11-20 13:36:19')
---
    public function create()
    {
        helper(['form']);

        $rules = [
            'name'      => 'required|min_length[3]|max_length[80]',
            'apaterno'  => 'required|min_length[3]|max_length[80]',
            'amaterno'  => 'required|min_length[3]|max_length[80]',
            'email'     => 'required|min_length[6]|max_length[80]|valid_email|is_unique[users.email]',
            'phone_no'  => 'required|min_length[6]|max_length[20]',
            'password'  => 'required|min_length[6]|max_length[200]',
            'role'      => 'required',
            'area'      => 'required'
        ];

        if ($this->validate($rules)) {
            $userModel = new UserModel();
            $areas = model('Area');
            $data = [
                'name'      => $this->request->getPost('name'),
                'apaterno'  => $this->request->getPost('apaterno'),
                'amaterno'  => $this->request->getPost('amaterno'),
                'email'     => $this->request->getPost('email'),
                'phone_no'  => $this->request->getPost('phone_no'),
                'password'  => password_hash($this->request->getPost('password'), PASSWORD_DEFAULT),
                'role'      => $this->request->getPost('role'),
                'area'      => $this->request->getPost('area')
            ];
            $userModel->save($data);

SELECT *
FROM `areas`
---
            $data = [
                'validation' => $this->validator,
                'title'      => 'Nuevo registro',
                'areas'     => $areas->findAll()

SELECT *
FROM `users`
WHERE `id` = '3'
 LIMIT 1
SELECT *
FROM `areas`
---
    public function edit($id = null)
    {
        // $usuario = $this->userModel->find($id);
        $usuario = $this->userModel->where('id', $id)->first();

        if ($usuario) {
            $areas = model('Area');

            $data = [
                'title'     => 'Editar datos',
                'areas'     => $areas->findAll(),